// 10-100之间的所有偶数
// for(i=10;i<=100;i++)
// {
//     if (i%2==0)
//     {
//         console.log(i);
//     }
// }
// 1-100之间所有数的和
// var sum=0;
// for(i=1;i<=100;i++)
// {
//     sum+=i;
// }
// console.log(sum);
// 1-100之间所有偶数的和
// sum=0;
// for(i=1;i<=100;i++)
// {
//     if (i%2==0)
//     {
//         sum+=i;
//     }
// }
// console.log(sum);
// 打印出 100-200之间能够被3整除或4整除的数
// for(var i=100;i<=200;i++)
// {
//     if(i%3==0||i%4==0){
//         console.log(i);
//     }
// }
                                           